In [118]:
import pandas as pd

In [119]:
movies=pd.read_csv("movies.csv", index_col="movieid")

# Display the number of rows and columns of the data-frame

In [120]:
movies.shape

(3832, 2)

In [121]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3832 entries, 1672052 to 2593313
Data columns (total 2 columns):
title    3832 non-null object
year     3832 non-null int64
dtypes: int64(1), object(1)
memory usage: 89.8+ KB

In [122]:
movies

                                 title  year
movieid
1672052        'Breaker' Morant (1980)  1980
1672111   'Crocodile' Dundee II (1988)  1988
1672580      'Til There Was You (1997)  1997
1672716          'night, Mother (1986)  1986
1672946  ...And Justice for All (2014)  2014
...                                ...   ...
2591814                eXistenZ (1999)  1999
2592334          ¡Three Amigos! (1986)  1986
2592963       À nous la liberté (1931)  1931
2593112          Á köldum klaka (1995)  1995
2593313                  Átame! (1990)  1990

[3832 rows x 2 columns]

# Display the number of movies per year

In [123]:
movies["year"].value_counts()

1996    332
1995    326
1998    319
1997    311
1999    273
       ...
1909      1
1911      1
1913      1
2001      1
1898      1
Name: year, Length: 108, dtype: int64

# Display number of movies released per year

In [124]:
#Display number of movies released in 1990
movies_1990=movies[movies["year"]==1990]
movies_1990.shape[0]

69

In [125]:
#Display number of movies released in 1991
movies_1991=movies[movies["year"]==1991]
movies_1991.shape[0]

65

In [126]:
# Display number of movies released in 1992
movies_1992=movies[movies["year"]==1992]
movies_1992.shape[0]

96

In [127]:
# Display number of movies released in 1993

movies_1993=movies[movies["year"]==1993]
movies_1993.shape[0]

153

In [128]:
# Display number of movies released in 1994

movies_1994=movies[movies["year"]==1994]
movies_1994.shape[0]

240

In [129]:
# Display number of movies released in 1995

movies_1995=movies[movies["year"]==1995]
movies_1995.shape[0]

326

In [130]:
# Display number of movies released in 1996

movies_1996=movies[movies["year"]==1996]
movies_1996.shape[0]

332

In [131]:
# Display number of movies released in 1997

movies_1997=movies[movies["year"]==1997]
movies_1997.shape[0]

311

In [132]:
# Display number of movies released in 1998

movies_1998=movies[movies["year"]==1998]
movies_1998.shape[0]

319

In [133]:
# Display number of movies released in 1999

movies_1999=movies[movies["year"]==1999]
movies_1999.shape[0]

273

In [134]:
# Display number of movies released in 2000

movies_2000=movies[movies["year"]==2000]
movies_2000.shape[0]

144

## AVERAGE TIME OF MOVIES PER YEAR

In [135]:
# Average time of movies per year

running_times=pd.read_csv("runningtimes.csv", index_col="movieid")

In [136]:
running_times

               time      addition  time1
movieid
1672052         107           NaN    107
1672111         108           NaN    108
1672580         113           NaN    113
1672716          96           NaN     96
1673647         140           NaN    140
...             ...           ...    ...
2592963      USA:83  (re-release)     83
2592963      USA:97           NaN     97
2593112  Germany:85           NaN     85
2593112      USA:83           NaN     83
2593313         111           NaN    111

[5086 rows x 3 columns]

In [137]:
#inner join between movies and running times taking movieid as key
join_movies_time = pd.merge(movies, running_times, on = "movieid")

In [138]:
join_movies_time

,title,year,time,addition,time1
movieid,,,,,
1672052,'Breaker' Morant (1980),1980,107,NaN,107
1672111,'Crocodile' Dundee II (1988),1988,108,NaN,108
1672580,'Til There Was You (1997),1997,113,NaN,113
1672716,"'night, Mother (1986)",1986,96,NaN,96
1673647,1-2-3-4 ou Les collants noirs (1961),1961,140,NaN,140
...,...,...,...,...,...
2592963,À nous la liberté (1931),1931,USA:83,(re-release),83
2592963,À nous la liberté (1931),1931,USA:97,NaN,97
2593112,Á köldum klaka (1995),1995,Germany:85,NaN,85
2593112,Á köldum klaka (1995),1995,USA:83,NaN,83
2593313,Átame! (1990),1990,111,NaN,111

In [139]:
#Average time of movies on 1990
#this code selecs movies of 1990 from the join between movies running time and movies

movies_time_1990 = join_movies_time[join_movies_time["year"]==1990]

#find the average of the column time1
avg_movies_time_1990= movies_time_1990["time1"].mean()

In [140]:
avg_movies_time_1990

111.08602150537635

In [141]:
#Average time of movies on 1991
#this code selecs movies of 1991 from the join between movies running time and movies

movies_time_1991 = join_movies_time[join_movies_time["year"]==1991]

#find the average of the column time1
avg_movies_time_1991= movies_time_1991["time1"].mean()

In [142]:
avg_movies_time_1991

115.0

In [143]:
#Average time of movies on 1992
#this code selecs movies of 1992 from the join between movies running time and movies

movies_time_1992 = join_movies_time[join_movies_time["year"]==1992]

#find the average of the column time1
avg_movies_time_1992= movies_time_1992["time1"].mean()

In [144]:
avg_movies_time_1992

107.51079136690647

In [145]:
#Average time of movies on 1993
#this code selecs movies of 1993 from the join between movies running time and movies

movies_time_1993 = join_movies_time[join_movies_time["year"]==1993]

#find the average of the column time1
avg_movies_time_1993= movies_time_1993["time1"].mean()

In [146]:
avg_movies_time_1993

113.46859903381643

In [147]:
#Average time of movies on 1994
#this code selecs movies of 1994 from the join between movies running time and movies

movies_time_1994 = join_movies_time[join_movies_time["year"]==1994]

#find the average of the column time1
avg_movies_time_1994= movies_time_1994["time1"].mean()

In [148]:
avg_movies_time_1994

105.53939393939395

In [149]:
#Average time of movies on 1995
#this code selecs movies of 1994 from the join between movies running time and movies

movies_time_1995 = join_movies_time[join_movies_time["year"]==1995]

#find the average of the column time1
avg_movies_time_1995= movies_time_1995["time1"].mean()

In [150]:
avg_movies_time_1995

104.02905569007264

In [151]:
#Average time of movies on 1996
#this code selecs movies of 1996 from the join between movies running time and movies

movies_time_1996 = join_movies_time[join_movies_time["year"]==1996]

#find the average of the column time1
avg_movies_time_1996= movies_time_1996["time1"].mean()

In [152]:
avg_movies_time_1996

103.30424528301887

In [153]:
#Average time of movies on 1997
#this code selecs movies of 1997 from the join between movies running time and movies

movies_time_1997 = join_movies_time[join_movies_time["year"]==1997]

#find the average of the column time1
avg_movies_time_1997= movies_time_1997["time1"].mean()

In [154]:
avg_movies_time_1997

103.47184986595174

In [155]:
#Average time of movies on 1998
#this code selecs movies of 1998 from the join between movies running time and movies

movies_time_1998 = join_movies_time[join_movies_time["year"]==1998]

#find the average of the column time1
avg_movies_time_1998= movies_time_1998["time1"].mean()

In [156]:
avg_movies_time_1998

103.11084337349398

In [157]:
#Average time of movies on 1999
#this code selecs movies of 1999 from the join between movies running time and movies

movies_time_1999 = join_movies_time[join_movies_time["year"]==1999]

#find the average of the column time1
avg_movies_time_1999= movies_time_1999["time1"].mean()

In [158]:
avg_movies_time_1999

105.57492354740062

In [159]:
#Average time of movies on 2000
#this code selecs movies of 2000 from the join between movies running time and movies

movies_time_2000 = join_movies_time[join_movies_time["year"]==2000]

#find the average of the column time1
avg_movies_time_2000= movies_time_2000["time1"].mean()

In [160]:
avg_movies_time_2000

104.65217391304348

## AVERAGE RATINGS PER YEAR

In [161]:
# Importing ratings table

ratings=pd.read_csv("ratings.csv", index_col="movieid")

In [162]:
ratings

         rank  votes distribution
movieid
1672052   7.8   8111   0000001222
1672111   5.3  32183   0001221000
1672580   4.4   1894   0011110000
1672716   7.0   1255   0000001212
1673647   6.5    128   0000111211
...       ...    ...          ...
2591814   6.8  56563   0000012210
2592334   6.2  36951   0000122100
2592963   7.6   2294   0000002311
2593112   6.9   1231   0000012211
2593313   6.9  12087   0000013210

[3773 rows x 3 columns]

In [163]:
#inner join between movies and running times taking movieid as key
join_movies_ratings = pd.merge(movies, ratings, on = "movieid")

In [164]:
join_movies_ratings

                                        title  year  rank  votes distribution
movieid
1672052               'Breaker' Morant (1980)  1980   7.8   8111   0000001222
1672111          'Crocodile' Dundee II (1988)  1988   5.3  32183   0001221000
1672580             'Til There Was You (1997)  1997   4.4   1894   0011110000
1672716                 'night, Mother (1986)  1986   7.0   1255   0000001212
1673647  1-2-3-4 ou Les collants noirs (1961)  1961   6.5    128   0000111211
...                                       ...   ...   ...    ...          ...
2591814                       eXistenZ (1999)  1999   6.8  56563   0000012210
2592334                 ¡Three Amigos! (1986)  1986   6.2  36951   0000122100
2592963              À nous la liberté (1931)  1931   7.6   2294   0000002311
2593112                 Á köldum klaka (1995)  1995   6.9   1231   0000012211
2593313                         Átame! (1990)  1990   6.9  12087   0000013210

[3773 rows x 5 columns]

In [165]:
#Average ratings of movies on 1990
#this code selecs movies of 1990 from the join between ratings and movies

ratings_1990 = join_movies_ratings[join_movies_ratings["year"]==1990]

#find the average of the column rank
avg_movies_ratings_1990= ratings_1990["rank"].mean()

In [166]:
avg_movies_ratings_1990

6.314492753623191

In [167]:
#Average ratings of movies on 1991
#this code selecs movies of 1991 from the join between ratings and movies

ratings_1991 = join_movies_ratings[join_movies_ratings["year"]==1991]

#find the average of the column rank
avg_movies_ratings_1991= ratings_1991["rank"].mean()

In [168]:
avg_movies_ratings_1991

6.4875

In [169]:
#Average ratings of movies on 1992
#this code selecs movies of 1992 from the join between ratings and movies

ratings_1992 = join_movies_ratings[join_movies_ratings["year"]==1992]

#find the average of the column rank
avg_movies_ratings_1992= ratings_1992["rank"].mean()

In [170]:
avg_movies_ratings_1992

6.422105263157893

In [171]:
#Average ratings of movies on 1993
#this code selecs movies of 1993 from the join between ratings and movies

ratings_1993 = join_movies_ratings[join_movies_ratings["year"]==1993]

#find the average of the column rank
avg_movies_ratings_1993= ratings_1993["rank"].mean()

In [172]:
avg_movies_ratings_1993

6.484967320261439

In [173]:
#Average ratings of movies on 1994
#this code selecs movies of 1994 from the join between ratings and movies

ratings_1994 = join_movies_ratings[join_movies_ratings["year"]==1994]

#find the average of the column rank
avg_movies_ratings_1994= ratings_1994["rank"].mean()

In [174]:
avg_movies_ratings_1994

6.256666666666667

In [175]:
#Average ratings of movies on 1995
#this code selecs movies of 1995 from the join between ratings and movies

ratings_1995 = join_movies_ratings[join_movies_ratings["year"]==1995]

#find the average of the column rank
avg_movies_ratings_1995= ratings_1995["rank"].mean()

In [176]:
avg_movies_ratings_1995

6.208923076923077

In [177]:
#Average ratings of movies on 1996
#this code selecs movies of 1996 from the join between ratings and movies

ratings_1996 = join_movies_ratings[join_movies_ratings["year"]==1996]

#find the average of the column rank
avg_movies_ratings_1996= ratings_1996["rank"].mean()

In [178]:
avg_movies_ratings_1996

6.021450151057398

In [179]:
#Average ratings of movies on 1997
#this code selecs movies of 1997 from the join between ratings and movies

ratings_1997 = join_movies_ratings[join_movies_ratings["year"]==1997]

#find the average of the column rank
avg_movies_ratings_1997= ratings_1997["rank"].mean()

In [180]:
avg_movies_ratings_1997

6.113225806451617

In [181]:
#Average ratings of movies on 1998
#this code selecs movies of 1998 from the join between ratings and movies

ratings_1998 = join_movies_ratings[join_movies_ratings["year"]==1998]

#find the average of the column rank
avg_movies_ratings_1998= ratings_1998["rank"].mean()

In [182]:
avg_movies_ratings_1998

6.1698113207547145

In [183]:
#Average ratings of movies on 1999
#this code selecs movies of 1999 from the join between ratings and movies

ratings_1999 = join_movies_ratings[join_movies_ratings["year"]==1999]

#find the average of the column rank
avg_movies_ratings_1999= ratings_1999["rank"].mean()

In [184]:
avg_movies_ratings_1999

6.19926470588235

In [185]:
#Average ratings of movies on 2000
#this code selecs movies of 2000 from the join between ratings and movies

ratings_2000 = join_movies_ratings[join_movies_ratings["year"]==2000]

#find the average of the column rank
avg_movies_ratings_2000= ratings_2000["rank"].mean()

In [186]:
avg_movies_ratings_2000

5.923611111111109

## TOTAL NUMBER OF VOTES PER YEAR

In [187]:
ratings_1990

                                       title  year  rank   votes distribution
movieid
1711133                   Air America (1990)  1990   5.5   15959   0001221000
1717144  All the Vermeers in New York (1990)  1990   6.5     321   0000011111
1721750                American Dream (1990)  1990   7.7     517   0000001222
1734803                 Arachnophobia (1990)  1990   6.3   35357   0000122100
1739234                   Asfour Stah (1990)  1990   6.9     594   0000013200
...                                      ...   ...   ...     ...          ...
2510683                  Total Recall (1990)  1990   7.5  160970   0000012310
2518736                         Trust (1990)  1990   7.5    5129   0000001212
2581836          Yo, la peor de todas (1990)  1990   6.8     365   0000011211
2583701                 Young Guns II (1990)  1990   6.1   17465   0000122100
2593313                        Átame! (1990)  1990   6.9   12087   0000013210

[69 rows x 5 columns]

In [188]:
#sum movies votes of 1990
sum_votes_1990=ratings_1990["votes"].sum()
sum_votes_1990

2987619

In [189]:
#sum movies votes of 1991
sum_votes_1991=ratings_1991["votes"].sum()
sum_votes_1991

2413574

In [190]:
#sum movies votes of 1992
sum_votes_1992=ratings_1992["votes"].sum()
sum_votes_1992

3304026

In [191]:
#sum movies votes of 1993
sum_votes_1993=ratings_1993["votes"].sum()
sum_votes_1993

4505980

In [192]:
#sum movies votes of 1994
sum_votes_1994=ratings_1994["votes"].sum()
sum_votes_1994

6957173

In [193]:
#sum movies votes of 1995
sum_votes_1995=ratings_1995["votes"].sum()
sum_votes_1995

7127838

In [194]:
#sum movies votes of 1996
sum_votes_1996=ratings_1996["votes"].sum()
sum_votes_1996

5723996

In [195]:
#sum movies votes of 1997
sum_votes_1997=ratings_1997["votes"].sum()
sum_votes_1997

7827569

In [196]:
#sum movies votes of 1998
sum_votes_1998=ratings_1998["votes"].sum()
sum_votes_1998

8169054

In [197]:
#sum movies votes of 1999
sum_votes_1999=ratings_1999["votes"].sum()
sum_votes_1999

10451905

In [198]:
#sum movies votes of 2000
sum_votes_2000=ratings_2000["votes"].sum()
sum_votes_2000

5158504

## TOP FIVE RANKED MOVIES

In [199]:
join_movies_ratings

                                        title  year  rank  votes distribution
movieid
1672052               'Breaker' Morant (1980)  1980   7.8   8111   0000001222
1672111          'Crocodile' Dundee II (1988)  1988   5.3  32183   0001221000
1672580             'Til There Was You (1997)  1997   4.4   1894   0011110000
1672716                 'night, Mother (1986)  1986   7.0   1255   0000001212
1673647  1-2-3-4 ou Les collants noirs (1961)  1961   6.5    128   0000111211
...                                       ...   ...   ...    ...          ...
2591814                       eXistenZ (1999)  1999   6.8  56563   0000012210
2592334                 ¡Three Amigos! (1986)  1986   6.2  36951   0000122100
2592963              À nous la liberté (1931)  1931   7.6   2294   0000002311
2593112                 Á köldum klaka (1995)  1995   6.9   1231   0000012211
2593313                         Átame! (1990)  1990   6.9  12087   0000013210

[3773 rows x 5 columns]

In [200]:
# 5 top movies ordered by rank
join_movies_ratings.sort_values(by=["rank"], ascending=False).head(5)

,title,year,rank,votes,distribution
movieid,,,,,
2477653,The Shawshank Redemption (1994),1994,9.3,998823,0000000125
2437277,The Godfather (1972),1972,9.2,706695,0000000125
2024833,"Il buono, il brutto, il cattivo. (1966)",1966,9.0,301575,0000000124
2280997,Pulp Fiction (1994),1994,9.0,775943,0000000124
2437299,The Godfather: Part II (1974),1974,9.0,457100,0000000124

In [201]:
# 5 top movies ordered by votes
join_movies_ratings.sort_values(by=["votes"], ascending=False).head(5)

                                   title  year  rank   votes distribution
movieid
2477653  The Shawshank Redemption (1994)  1994   9.3  998823   0000000125
2280997              Pulp Fiction (1994)  1994   9.0  775943   0000000124
1936800                Fight Club (1999)  1999   8.9  759494   0000000124
2457464                The Matrix (1999)  1999   8.7  719107   0000000123
2437277             The Godfather (1972)  1972   9.2  706695   0000000125

## TOP 20 ACTION MOVIES

In [202]:
# Importing movies - directors 

movies_directors=pd.read_csv("movies2directors.csv", index_col="movieid")

In [203]:
movies_directors

         directorid      genre
movieid
1672052       22397      Drama
1672111       54934     Action
1672580      297253     Comedy
1672716      188926      Drama
1672946      188940     Action
...             ...        ...
2591814       57348     Sci-Fi
2592334      151963  Adventure
2592963       50126     Comedy
2593112       90204     Comedy
2593313        5442     Comedy

[4141 rows x 2 columns]

In [204]:
#inner join between JOIN MOVIES RATINGS and MOVIES DIRECTORS taking movieid as key
join_movies_ratings_directors = pd.merge(join_movies_ratings, movies_directors, on = "movieid")

In [205]:
join_movies_ratings_directors

,title,year,rank,votes,distribution,directorid,genre
movieid,,,,,,,
1672052,'Breaker' Morant (1980),1980,7.8,8111,0000001222,22397,Drama
1672111,'Crocodile' Dundee II (1988),1988,5.3,32183,0001221000,54934,Action
1672580,'Til There Was You (1997),1997,4.4,1894,0011110000,297253,Comedy
1672716,"'night, Mother (1986)",1986,7.0,1255,0000001212,188926,Drama
1673647,1-2-3-4 ou Les collants noirs (1961),1961,6.5,128,0000111211,302682,Drama
...,...,...,...,...,...,...,...
2591814,eXistenZ (1999),1999,6.8,56563,0000012210,57348,Sci-Fi
2592334,¡Three Amigos! (1986),1986,6.2,36951,0000122100,151963,Adventure
2592963,À nous la liberté (1931),1931,7.6,2294,0000002311,50126,Comedy
2593112,Á köldum klaka (1995),1995,6.9,1231,0000012211,90204,Comedy
2593313,Átame! (1990),1990,6.9,12087,0000013210,5442,Comedy

In [206]:
#the JOIN_MOVIES_RATINGS_DIRECTORS has duplicates, because there are movies with more than 1 director
# in order to know what the duplicates are, we need to run the next function:

duplicados = join_movies_ratings_directors[join_movies_ratings_directors.duplicated(["title"])]

In [207]:
duplicados

,title,year,rank,votes,distribution,directorid,genre
movieid,,,,,,,
1684486,A Bug's Life (1998),1998,7.2,135147,0000013200,261605,Adventure
1688103,A Fish Called Wanda (1988),1988,7.6,81299,0000002311,57086,Comedy
1690710,A Letter from Death Row (1998),1998,3.8,414,2011000001,183239,Crime
1693225,A Night at the Roxbury (1998),1998,5.9,36807,0000111101,114305,Comedy
1693818,A Perfect Candidate (1996),1996,6.8,198,0.00002211,282937,Documentary
...,...,...,...,...,...,...,...
2559217,We're Back! A Dinosaur's Story (1993),1993,5.7,6869,0000121001,305551,Adventure
2561516,West Side Story (1961),1961,7.6,48742,0000001212,297774,Crime
2562421,What Ever Happened to Aunt Alice? (1969),1969,6.9,1044,0000012111,137231,Crime
2571358,Wings (1927),1927,7.7,4985,0000001212,293085,Action
2587077,Zbogum na dvaesetiot vek (1998),1998,6.8,348,0000001112,218353,Adventure

In [208]:
# Data frame WHITHOUT duplicates

movies_no_duplicates = join_movies_ratings_directors.drop_duplicates(subset= "title")

In [209]:
movies_no_duplicates

,title,year,rank,votes,distribution,directorid,genre
movieid,,,,,,,
1672052,'Breaker' Morant (1980),1980,7.8,8111,0000001222,22397,Drama
1672111,'Crocodile' Dundee II (1988),1988,5.3,32183,0001221000,54934,Action
1672580,'Til There Was You (1997),1997,4.4,1894,0011110000,297253,Comedy
1672716,"'night, Mother (1986)",1986,7.0,1255,0000001212,188926,Drama
1673647,1-2-3-4 ou Les collants noirs (1961),1961,6.5,128,0000111211,302682,Drama
...,...,...,...,...,...,...,...
2591814,eXistenZ (1999),1999,6.8,56563,0000012210,57348,Sci-Fi
2592334,¡Three Amigos! (1986),1986,6.2,36951,0000122100,151963,Adventure
2592963,À nous la liberté (1931),1931,7.6,2294,0000002311,50126,Comedy
2593112,Á köldum klaka (1995),1995,6.9,1231,0000012211,90204,Comedy
2593313,Átame! (1990),1990,6.9,12087,0000013210,5442,Comedy

In [210]:
#List of ACTION movies

action_movies = movies_no_duplicates[movies_no_duplicates["genre"]=="Action"]

In [211]:
action_movies

,title,year,rank,votes,distribution,directorid,genre
movieid,,,,,,,
1672111,'Crocodile' Dundee II (1988),1988,5.3,32183,0001221000,54934,Action
1679461,3 Ninjas: High Noon at Mega Mountain (1998),1998,2.4,7423,4100000001,179783,Action
1691387,A Low Down Dirty Shame (1994),1994,5.4,2724,0001121000,291700,Action
1693305,A Night to Remember (1958),1958,7.9,8325,0000001311,14663,Action
1698667,A View to a Kill (1985),1985,6.2,46099,0000122100,98630,Action
...,...,...,...,...,...,...,...
2577314,X-Men (2000),2000,7.4,258326,0000013310,254763,Action
2578330,Xing xing wang (1977),1977,5.4,798,0001111000,118759,Action
2583695,Young Guns (1988),1988,6.6,31155,0000022100,38785,Action
2583966,Young Sherlock Holmes (1985),1985,6.6,10568,0000012100,158572,Action
2585507,Yôjinbô (1961),1961,8.3,46720,0000001222,149249,Action

In [212]:
# list of the top 20 action movies and their launch year in a descending order based on average ratings

action_movies.sort_values(by=["rank"], ascending=False).head(20)

,title,year,rank,votes,distribution,directorid,genre
movieid,,,,,,,
2371726,Star Wars (1977),1977,8.8,547422,0000000123,164445,Action
2371786,Star Wars: Episode V - The Empire Strikes Back...,1980,8.8,487093,0000000123,139740,Action
2457464,The Matrix (1999),1999,8.7,719107,0000000123,288437,Action
2324123,Saving Private Ryan (1998),1998,8.6,509427,0000001222,260322,Action
2288828,Raiders of the Lost Ark (1981),1981,8.6,411425,0000001222,260322,Action
2401750,Terminator 2: Judgment Day (1991),1991,8.6,447716,0000001222,39629,Action
2216316,North by Northwest (1959),1959,8.5,145161,0000001222,118604,Action
1715404,Aliens (1986),1986,8.5,304118,0000001222,39629,Action
1968813,Gladiator (2000),2000,8.5,558053,0000001222,247236,Action
2371787,Star Wars: Episode VI - Return of the Jedi (1983),1983,8.4,382574,0000001222,172392,Action
1850182,Das Boot (1981),1981,8.4,111003,0000001222,213822,Action
1787090,Braveheart (1995),1995,8.4,449005,0000001223,96982,Action
2486817,The Treasure of the Sierra Madre (1948),1948,8.4,51705,0000001222,123878,Action
2034464,Indiana Jones and the Last Crusade (1989),1989,8.3,314024,0000001222,260322,Action
2585507,Yôjinbô (1961),1961,8.3,46720,0000001222,149249,Action
2290316,Ran (1985),1985,8.3,51773,0000001222,149249,Action
1874279,Die Hard (1988),1988,8.3,369277,0000001322,180080,Action
1992217,Heat (1995),1995,8.3,276320,0000001222,170452,Action
2263670,Platoon (1986),1986,8.2,188940,0000001321,264169,Action
1763465,Ben-Hur (1959),1959,8.1,99495,0000001222,300073,Action

## LIST OF DIRECTOS
Including the number of movies, gross income, average income per movie
maximum ranks, minimun ranks, ORDER BY director with Highest average income

In [213]:
#Import directors file 
directors=pd.read_csv("directors.csv", index_col="directorid")

In [214]:
directors

                            name  rate        gross  num
directorid
67            Aalmuhammed, Jefri   7.0      42952.0    1
92          Aarniokoski, Douglas   4.3   12801190.0    1
284           Abbott, George (I)   6.8          0.0    1
708            Abraham, Adam (I)   6.8      33031.0    1
746                Abrahams, Jim  26.2  213481148.0    4
...                          ...   ...          ...  ...
305962             Zwick, Edward  33.8  267712025.0    5
305978            Zwigoff, Terry   7.8    3174695.0    1
306168         Ávila, Carlos (I)   5.9    3542843.0    1
306343            Ôshima, Nagisa  13.5     213736.0    2
306351          Ôtomo, Katsuhiro   7.9     114009.0    1

[2201 rows x 4 columns]

In [215]:
ratings

         rank  votes distribution
movieid
1672052   7.8   8111   0000001222
1672111   5.3  32183   0001221000
1672580   4.4   1894   0011110000
1672716   7.0   1255   0000001212
1673647   6.5    128   0000111211
...       ...    ...          ...
2591814   6.8  56563   0000012210
2592334   6.2  36951   0000122100
2592963   7.6   2294   0000002311
2593112   6.9   1231   0000012211
2593313   6.9  12087   0000013210

[3773 rows x 3 columns]

In [217]:
# Importing movies - directors 

movies_directors_no_id=pd.read_csv("movies2directors.csv")

In [218]:
movies_directors_no_id

      movieid  directorid      genre
0     1672052       22397      Drama
1     1672111       54934     Action
2     1672580      297253     Comedy
3     1672716      188926      Drama
4     1672946      188940     Action
...       ...         ...        ...
4136  2591814       57348     Sci-Fi
4137  2592334      151963  Adventure
4138  2592963       50126     Comedy
4139  2593112       90204     Comedy
4140  2593313        5442     Comedy

[4141 rows x 3 columns]

In [221]:
#inner join between MOVIES_DIRECTORS_NO_ID and RATINGS taking directorid as key
join_movies_directors_ratings = pd.merge(ratings, movies_directors_no_id, on = "movieid")

In [222]:
join_movies_directors_ratings

      movieid  rank  votes distribution  directorid      genre
0     1672052   7.8   8111   0000001222       22397      Drama
1     1672111   5.3  32183   0001221000       54934     Action
2     1672580   4.4   1894   0011110000      297253     Comedy
3     1672716   7.0   1255   0000001212      188926      Drama
4     1673647   6.5    128   0000111211      302682      Drama
...       ...   ...    ...          ...         ...        ...
4087  2591814   6.8  56563   0000012210       57348     Sci-Fi
4088  2592334   6.2  36951   0000122100      151963  Adventure
4089  2592963   7.6   2294   0000002311       50126     Comedy
4090  2593112   6.9   1231   0000012211       90204     Comedy
4091  2593313   6.9  12087   0000013210        5442     Comedy

[4092 rows x 6 columns]

In [225]:
#INNER JOIN Between the table joined with movies2directors-ratings WITH directors
#the join key will be DIRECTORID
join_movies_directors_ratings_directors = pd.merge(join_movies_directors_ratings, directors, on = "directorid")

In [226]:
join_movies_directors_ratings_directors

,movieid,rank,votes,distribution,directorid,genre,name,rate,gross,num
0,1672052,7.8,8111,0000001222,22397,Drama,"Beresford, Bruce",57.6,364854433.0,9
1,1689117,4.9,1609,0001221000,22397,Comedy,"Beresford, Bruce",57.6,364854433.0,9
2,1837991,6.3,2099,0000122100,22397,Comedy,"Beresford, Bruce",57.6,364854433.0,9
3,1888823,6.2,41693,0000122100,22397,Crime,"Beresford, Bruce",57.6,364854433.0,9
4,1892991,7.4,43720,0000012310,22397,Comedy,"Beresford, Bruce",57.6,364854433.0,9
...,...,...,...,...,...,...,...,...,...,...
4087,2587077,6.8,348,0000001112,218353,Adventure,"Popovski, Aleksandar",6.8,0.0,1
4088,2587786,6.8,10019,0000012211,136658,Comedy,"Kasdan, Jake",6.8,1980338.0,1
4089,2590181,4.7,182,0001110000,270707,Sci-Fi,"Tatoulis, John",4.7,19998.0,1
4090,2592963,7.6,2294,0000002311,50126,Comedy,"Clair, René",7.6,0.0,1
4091,2593112,6.9,1231,0000012211,90204,Comedy,"Friðriksson, Friðrik Þór",6.9,337560.0,1

In [233]:
#adding a new column with the average income, this average income is gross / num

join_movies_directors_ratings_directors["Average_Income"]=join_movies_directors_ratings_directors.apply(lambda row: (row.gross/row.num), axis=1)

In [245]:
join_movies_directors_ratings_directors

,movieid,rank,votes,distribution,directorid,genre,name,rate,gross,num,Average_Income
0,1672052,7.8,8111,0000001222,22397,Drama,"Beresford, Bruce",57.6,364854433.0,9,4.053938e+07
1,1689117,4.9,1609,0001221000,22397,Comedy,"Beresford, Bruce",57.6,364854433.0,9,4.053938e+07
2,1837991,6.3,2099,0000122100,22397,Comedy,"Beresford, Bruce",57.6,364854433.0,9,4.053938e+07
3,1888823,6.2,41693,0000122100,22397,Crime,"Beresford, Bruce",57.6,364854433.0,9,4.053938e+07
4,1892991,7.4,43720,0000012310,22397,Comedy,"Beresford, Bruce",57.6,364854433.0,9,4.053938e+07
...,...,...,...,...,...,...,...,...,...,...,...
4087,2587077,6.8,348,0000001112,218353,Adventure,"Popovski, Aleksandar",6.8,0.0,1,0.000000e+00
4088,2587786,6.8,10019,0000012211,136658,Comedy,"Kasdan, Jake",6.8,1980338.0,1,1.980338e+06
4089,2590181,4.7,182,0001110000,270707,Sci-Fi,"Tatoulis, John",4.7,19998.0,1,1.999800e+04
4090,2592963,7.6,2294,0000002311,50126,Comedy,"Clair, René",7.6,0.0,1,0.000000e+00
4091,2593112,6.9,1231,0000012211,90204,Comedy,"Friðriksson, Friðrik Þór",6.9,337560.0,1,3.375600e+05

In [286]:
max_rank=join_movies_directors_ratings_directors.groupby(["directorid","name","num", "gross", "Average_Income"], as_index=False)["rank"].max()

In [287]:
max_rank

      directorid                  name  num        gross  Average_Income  rank
0             67    Aalmuhammed, Jefri    1      42952.0         42952.0   7.0
1             92  Aarniokoski, Douglas    1   12801190.0      12801190.0   4.3
2            284    Abbott, George (I)    1          0.0             0.0   6.8
3            708     Abraham, Adam (I)    1      33031.0         33031.0   6.8
4            746         Abrahams, Jim    4  213481148.0      53370287.0   7.8
...          ...                   ...  ...          ...             ...   ...
2148      305962         Zwick, Edward    5  267712025.0      53542405.0   7.9
2149      305978        Zwigoff, Terry    1    3174695.0       3174695.0   7.8
2150      306168     Ávila, Carlos (I)    1    3542843.0       3542843.0   5.9
2151      306343        Ôshima, Nagisa    2     213736.0        106868.0   6.9
2152      306351      Ôtomo, Katsuhiro    1     114009.0        114009.0   7.9

[2153 rows x 6 columns]

In [288]:
max_rank.rename(columns={'rank':'Maxi_Rank'}, inplace=True)

In [294]:
max_rank

,directorid,name,num,gross,Average_Income,Maxi_Rank
0,67,"Aalmuhammed, Jefri",1,42952.0,42952.0,7.0
1,92,"Aarniokoski, Douglas",1,12801190.0,12801190.0,4.3
2,284,"Abbott, George (I)",1,0.0,0.0,6.8
3,708,"Abraham, Adam (I)",1,33031.0,33031.0,6.8
4,746,"Abrahams, Jim",4,213481148.0,53370287.0,7.8
...,...,...,...,...,...,...
2148,305962,"Zwick, Edward",5,267712025.0,53542405.0,7.9
2149,305978,"Zwigoff, Terry",1,3174695.0,3174695.0,7.8
2150,306168,"Ávila, Carlos (I)",1,3542843.0,3542843.0,5.9
2151,306343,"Ôshima, Nagisa",2,213736.0,106868.0,6.9
2152,306351,"Ôtomo, Katsuhiro",1,114009.0,114009.0,7.9

In [290]:
min_rank=join_movies_directors_ratings_directors.groupby(["directorid","name","num", "gross", "Average_Income"], as_index=False)["rank"].min()

In [292]:
min_rank.rename(columns={'rank':'Min_Rank'}, inplace=True)

In [295]:
min_rank

,directorid,name,num,gross,Average_Income,Min_Rank
0,67,"Aalmuhammed, Jefri",1,42952.0,42952.0,7.0
1,92,"Aarniokoski, Douglas",1,12801190.0,12801190.0,4.3
2,284,"Abbott, George (I)",1,0.0,0.0,6.8
3,708,"Abraham, Adam (I)",1,33031.0,33031.0,6.8
4,746,"Abrahams, Jim",4,213481148.0,53370287.0,5.2
...,...,...,...,...,...,...
2148,305962,"Zwick, Edward",5,267712025.0,53542405.0,5.9
2149,305978,"Zwigoff, Terry",1,3174695.0,3174695.0,7.8
2150,306168,"Ávila, Carlos (I)",1,3542843.0,3542843.0,5.9
2151,306343,"Ôshima, Nagisa",2,213736.0,106868.0,6.6
2152,306351,"Ôtomo, Katsuhiro",1,114009.0,114009.0,7.9

In [300]:
max_min_rank = pd.merge(max_rank, min_rank)

In [301]:
max_min_rank

,directorid,name,num,gross,Average_Income,Maxi_Rank,Min_Rank
0,67,"Aalmuhammed, Jefri",1,42952.0,42952.0,7.0,7.0
1,92,"Aarniokoski, Douglas",1,12801190.0,12801190.0,4.3,4.3
2,284,"Abbott, George (I)",1,0.0,0.0,6.8,6.8
3,708,"Abraham, Adam (I)",1,33031.0,33031.0,6.8,6.8
4,746,"Abrahams, Jim",4,213481148.0,53370287.0,7.8,5.2
...,...,...,...,...,...,...,...
2148,305962,"Zwick, Edward",5,267712025.0,53542405.0,7.9,5.9
2149,305978,"Zwigoff, Terry",1,3174695.0,3174695.0,7.8,7.8
2150,306168,"Ávila, Carlos (I)",1,3542843.0,3542843.0,5.9,5.9
2151,306343,"Ôshima, Nagisa",2,213736.0,106868.0,6.9,6.6
2152,306351,"Ôtomo, Katsuhiro",1,114009.0,114009.0,7.9,7.9

In [303]:
max_min_rank.sort_values(by=["Average_Income"], ascending=False, inplace=True)

In [304]:
max_min_rank

,directorid,name,num,gross,Average_Income,Maxi_Rank,Min_Rank
22,5201,"Allers, Roger",1,9.455787e+08,9.455787e+08,8.4,8.4
270,39629,"Cameron, James (I)",6,3.295280e+09,5.492134e+08,8.6,7.2
1307,185384,"Minkoff, Rob",2,1.085594e+09,5.427970e+08,8.4,5.8
213,31746,"Brannon, Ash",1,4.850152e+08,4.850152e+08,7.9,7.9
1956,280572,"Unkrich, Lee",1,4.850152e+08,4.850152e+08,7.9,7.9
...,...,...,...,...,...,...,...
929,135331,"Kandel, Linda (I)",1,0.000000e+00,0.000000e+00,4.9,4.9
923,133692,"Juran, Nathan",1,0.000000e+00,0.000000e+00,7.1,7.1
1725,246326,"Schuster, Harold D.",1,0.000000e+00,0.000000e+00,7.1,7.1
921,133424,"Julian, Rupert",1,0.000000e+00,0.000000e+00,7.7,7.7
744,111178,"Hare, David (I)",1,0.000000e+00,0.000000e+00,5.9,5.9

## WHICH ACTION MOVIES WERE DIRECTED BY RIDLEY SCOTT ORSTEEN SPIELBERG

In [305]:
action_movies

,title,year,rank,votes,distribution,directorid,genre
movieid,,,,,,,
1672111,'Crocodile' Dundee II (1988),1988,5.3,32183,0001221000,54934,Action
1679461,3 Ninjas: High Noon at Mega Mountain (1998),1998,2.4,7423,4100000001,179783,Action
1691387,A Low Down Dirty Shame (1994),1994,5.4,2724,0001121000,291700,Action
1693305,A Night to Remember (1958),1958,7.9,8325,0000001311,14663,Action
1698667,A View to a Kill (1985),1985,6.2,46099,0000122100,98630,Action
...,...,...,...,...,...,...,...
2577314,X-Men (2000),2000,7.4,258326,0000013310,254763,Action
2578330,Xing xing wang (1977),1977,5.4,798,0001111000,118759,Action
2583695,Young Guns (1988),1988,6.6,31155,0000022100,38785,Action
2583966,Young Sherlock Holmes (1985),1985,6.6,10568,0000012100,158572,Action
2585507,Yôjinbô (1961),1961,8.3,46720,0000001222,149249,Action

In [306]:
directors

                            name  rate        gross  num
directorid
67            Aalmuhammed, Jefri   7.0      42952.0    1
92          Aarniokoski, Douglas   4.3   12801190.0    1
284           Abbott, George (I)   6.8          0.0    1
708            Abraham, Adam (I)   6.8      33031.0    1
746                Abrahams, Jim  26.2  213481148.0    4
...                          ...   ...          ...  ...
305962             Zwick, Edward  33.8  267712025.0    5
305978            Zwigoff, Terry   7.8    3174695.0    1
306168         Ávila, Carlos (I)   5.9    3542843.0    1
306343            Ôshima, Nagisa  13.5     213736.0    2
306351          Ôtomo, Katsuhiro   7.9     114009.0    1

[2201 rows x 4 columns]

In [326]:
#JOIN action_movies and directors with directorid as key
action_movies_directors = pd.merge(action_movies, directors, on="directorid")

In [327]:
action_movies_directors

,title,year,rank,votes,distribution,directorid,genre,name,rate,gross,num
0,'Crocodile' Dundee II (1988),1988,5.3,32183,0001221000,54934,Action,"Cornell, John (I)",5.3,2.397000e+08,1
1,3 Ninjas: High Noon at Mega Mountain (1998),1998,2.4,7423,4100000001,179783,Action,"McNamara, Sean (I)",2.4,3.080820e+05,1
2,A Low Down Dirty Shame (1994),1994,5.4,2724,0001121000,291700,Action,"Wayans, Keenen Ivory",11.5,3.074122e+08,2
3,A Night to Remember (1958),1958,7.9,8325,0000001311,14663,Action,"Baker, Roy Ward",21.2,0.000000e+00,3
4,A View to a Kill (1985),1985,6.2,46099,0000122100,98630,Action,"Glen, John (II)",22.7,5.064176e+08,4
...,...,...,...,...,...,...,...,...,...,...,...
531,Wrongfully Accused (1998),1998,5.7,13118,0000121100,220520,Action,"Proft, Pat",5.7,9.604029e+06,1
532,Wyatt Earp (1994),1994,6.5,23877,0000122100,136660,Action,"Kasdan, Lawrence",40.7,1.258654e+08,6
533,X-Men (2000),2000,7.4,258326,0000013310,254763,Action,"Singer, Bryan",28.0,1.672587e+08,4
534,Xing xing wang (1977),1977,5.4,798,0001111000,118759,Action,"Ho, Meng Hua",5.4,1.595000e+04,1
535,Young Sherlock Holmes (1985),1985,6.6,10568,0000012100,158572,Action,"Levinson, Barry (I)",85.8,1.069122e+09,13

In [330]:
#List of action movies where directors are Spielberg or Scott
action_movies_directors[(action_movies_directors["name"]=="Spielberg, Steven") | (action_movies_directors["name"]=="Scott, Ridley")]

,title,year,rank,votes,distribution,directorid,genre,name,rate,gross,num
227,G.I. Jane (1997),1997,5.7,44186,0000121100,247236,Action,"Scott, Ridley",57.0,8.509014e+08,8
228,Gladiator (2000),2000,8.5,558053,0000001222,247236,Action,"Scott, Ridley",57.0,8.509014e+08,8
229,Someone to Watch Over Me (1987),1987,6.0,5283,0000122100,247236,Action,"Scott, Ridley",57.0,8.509014e+08,8
275,Indiana Jones and the Last Crusade (1989),1989,8.3,314024,0000001222,260322,Action,"Spielberg, Steven",108.1,5.520277e+09,14
276,Indiana Jones and the Temple of Doom (1984),1984,7.6,197674,0000012311,260322,Action,"Spielberg, Steven",108.1,5.520277e+09,14
277,Raiders of the Lost Ark (1981),1981,8.6,411425,0000001222,260322,Action,"Spielberg, Steven",108.1,5.520277e+09,14
278,Saving Private Ryan (1998),1998,8.6,509427,0000001222,260322,Action,"Spielberg, Steven",108.1,5.520277e+09,14
279,The Lost World: Jurassic Park (1997),1997,6.4,162626,0000122100,260322,Action,"Spielberg, Steven",108.1,5.520277e+09,14